backend-rails2/app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "answers" ("content", "created_at", "question_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "rumba!"], ["created_at", "2015-05-01 19:00:35.696399"], ["question_id", 1], ["title", "what ling will buy"], ["updated_at", "2015-05-01 19:00:35.696399"]]
---
  def create
    @question = Question.find(params[:question_id])

    @answer = Answer.new(answer_params)
    @answer.question = @question
    if @answer.save

SELECT  "answers".* FROM "answers"  WHERE "answers"."id" = 1  ORDER BY "answers"."id" ASC LIMIT 1
---
  def upvote
    answer = Answer.where(id: params[:id]).first

SELECT  "answers".* FROM "answers"  WHERE "answers"."id" = 1  ORDER BY "answers"."id" ASC LIMIT 1
---
  def downvote
    answer = Answer.where(id: params[:id]).first