backend-rails2/app/controllers/questions_controller.rb

  def show
    @question = Question.where(id: params[:id]).first
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = 1  ORDER BY "questions"."id" ASC LIMIT 1

  def create
    @question = Question.new(question_params)
      # redirect_to root_pathp
    # if request.xhr?
    # respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "when you are making money?"], ["created_at", "2015-05-01 19:00:05.681935"], ["title", "what will you buy"], ["updated_at", "2015-05-01 19:00:05.681935"]]

  def upvote
    question = Question.where(id: params[:id]).first
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = 1  ORDER BY "questions"."id" ASC LIMIT 1

  def downvote
    p "i am before find question"
    question = Question.where(id: params[:id]).first
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = 1  ORDER BY "questions"."id" ASC LIMIT 1